Autodesk.Revit.DB.Mechanical.HVACZoneData.ZoneEquipmentId
The id of the zone equipment related to the zone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Mechanical.HVACZoneData
Represents the specific domain requirements for a system-zone upgraded from an HVAC zone.
Since:
2027